In [ ]:
import numpy as np
import pandas as pd

In [ ]:
S = pd.Series([1,2,1,2,2,2,3,3,4,4,4,1,1,2],index = np.arange(14))

In [ ]:
S

0     1
1     2
2     1
3     2
4     2
5     2
6     3
7     3
8     4
9     4
10    4
11    1
12    1
13    2
dtype: int64

In [ ]:
S.value_counts()

2    5
1    4
4    3
3    2
dtype: int64

# DataFrame

In [ ]:
df = pd.DataFrame()

In [ ]:
df

Empty DataFrame
Columns: []
Index: []

In [ ]:
df = pd.DataFrame(['Python','java','C','C++'])

In [ ]:
df

        0
0  Python
1    java
2       C
3     C++

In [ ]:
ratings = [1,3,4,2]
df[1]=ratings

In [ ]:
df

        0  1
0  Python  1
1    java  3
2       C  4
3     C++  2

In [ ]:
df[2]=['simple','medium','Basic','Typical']

In [ ]:
df

        0  1        2
0  Python  1   simple
1    java  3   medium
2       C  4    Basic
3     C++  2  Typical

In [ ]:
df.columns=['Language','Rating','Type']

In [ ]:
df

  Language  Rating     Type
0   Python       1   simple
1     java       3   medium
2        C       4    Basic
3      C++       2  Typical

In [ ]:
df['Language']

0    Python
1      java
2         C
3       C++
Name: Language, dtype: object

In [ ]:
df['Rating']

0    1
1    3
2    4
3    2
Name: Rating, dtype: int64

In [ ]:
df['Type']

0     simple
1     medium
2      Basic
3    Typical
Name: Type, dtype: object

In [ ]:
# create a dataframe from dictionary

In [ ]:
data = [{1:'a',2:'b',3:'c'}]
df1 = pd.DataFrame(data)

In [ ]:
df1

   1  2  3
0  a  b  c

In [ ]:
data = [{1:'a',2:'b'},{1:'c',2:'d'},{1:'e',2:'f'}]

In [ ]:
df2 = pd.DataFrame(data)

In [ ]:
df2

   1  2
0  a  b
1  c  d
2  e  f

In [ ]:
#create a dataframe of random numbers with data indices

In [ ]:
# create a range of dates

In [ ]:
dates = pd.date_range(start = '2021-12-21',end = '2021-12-26')

In [ ]:
dates

DatetimeIndex(['2021-12-21', '2021-12-22', '2021-12-23', '2021-12-24',
               '2021-12-25', '2021-12-26'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
dates = pd.date_range(start = '2021-12-21',periods = 5)

In [ ]:
dates

DatetimeIndex(['2021-12-21', '2021-12-22', '2021-12-23', '2021-12-24',
               '2021-12-25'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
dates = pd.date_range('today',periods = 7)

In [ ]:
dates

DatetimeIndex(['2021-12-21 10:43:50.491586', '2021-12-22 10:43:50.491586',
               '2021-12-23 10:43:50.491586', '2021-12-24 10:43:50.491586',
               '2021-12-25 10:43:50.491586', '2021-12-26 10:43:50.491586',
               '2021-12-27 10:43:50.491586'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
dates = pd.date_range(start = '2021-12-21',periods =7)

In [ ]:
dates

DatetimeIndex(['2021-12-21', '2021-12-22', '2021-12-23', '2021-12-24',
               '2021-12-25', '2021-12-26', '2021-12-27'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
M = np.random.random((7,7))

In [ ]:
M

array([[0.42415725, 0.1510046 , 0.43302171, 0.927524  , 0.68990686,
        0.01063168, 0.15559882],
       [0.0057369 , 0.92093906, 0.28657263, 0.10362386, 0.09567043,
        0.77176555, 0.45213264],
       [0.85904637, 0.58168955, 0.76178259, 0.89437481, 0.17326334,
        0.54819771, 0.5584342 ],
       [0.66781564, 0.88732841, 0.85079913, 0.87207141, 0.75706712,
        0.81580166, 0.36601817],
       [0.03181797, 0.4515949 , 0.79507545, 0.91259789, 0.13227661,
        0.60606223, 0.35549192],
       [0.51040823, 0.6567242 , 0.62127442, 0.65660009, 0.17455879,
        0.38154456, 0.07505636],
       [0.1271438 , 0.63611685, 0.05499727, 0.16161749, 0.51503247,
        0.71584092, 0.69950913]])

In [ ]:
dframe = pd.DataFrame(M,index=dates)

In [ ]:
dframe

,0,1,2,3,4,5,6
2021-12-21,0.424157,0.151005,0.433022,0.927524,0.689907,0.010632,0.155599
2021-12-22,0.005737,0.920939,0.286573,0.103624,0.095670,0.771766,0.452133
2021-12-23,0.859046,0.581690,0.761783,0.894375,0.173263,0.548198,0.558434
2021-12-24,0.667816,0.887328,0.850799,0.872071,0.757067,0.815802,0.366018
2021-12-25,0.031818,0.451595,0.795075,0.912598,0.132277,0.606062,0.355492
2021-12-26,0.510408,0.656724,0.621274,0.656600,0.174559,0.381545,0.075056
2021-12-27,0.127144,0.636117,0.054997,0.161617,0.515032,0.715841,0.699509

In [ ]:
dframe.columns = ['C1','C2','C3','C4','C5','C6','C7']

In [ ]:
dframe

,C1,C2,C3,C4,C5,C6,C7
2021-12-21,0.424157,0.151005,0.433022,0.927524,0.689907,0.010632,0.155599
2021-12-22,0.005737,0.920939,0.286573,0.103624,0.095670,0.771766,0.452133
2021-12-23,0.859046,0.581690,0.761783,0.894375,0.173263,0.548198,0.558434
2021-12-24,0.667816,0.887328,0.850799,0.872071,0.757067,0.815802,0.366018
2021-12-25,0.031818,0.451595,0.795075,0.912598,0.132277,0.606062,0.355492
2021-12-26,0.510408,0.656724,0.621274,0.656600,0.174559,0.381545,0.075056
2021-12-27,0.127144,0.636117,0.054997,0.161617,0.515032,0.715841,0.699509

In [ ]:
dframe['C1']

2021-12-21    0.424157
2021-12-22    0.005737
2021-12-23    0.859046
2021-12-24    0.667816
2021-12-25    0.031818
2021-12-26    0.510408
2021-12-27    0.127144
Freq: D, Name: C1, dtype: float64

In [ ]:
dframe.index # list index

DatetimeIndex(['2021-12-21', '2021-12-22', '2021-12-23', '2021-12-24',
               '2021-12-25', '2021-12-26', '2021-12-27'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
dframe.columns # list of columns

Index(['C1', 'C2', 'C3', 'C4', 'C5', 'C6', 'C7'], dtype='object')

In [ ]:
#data type of each column

In [ ]:
dframe.dtypes

C1    float64
C2    float64
C3    float64
C4    float64
C5    float64
C6    float64
C7    float64
dtype: object

In [ ]:
# sort dataframe by column C1 in ascending order
dframe.sort_values(by='C1')

,C1,C2,C3,C4,C5,C6,C7
2021-12-22,0.005737,0.920939,0.286573,0.103624,0.095670,0.771766,0.452133
2021-12-25,0.031818,0.451595,0.795075,0.912598,0.132277,0.606062,0.355492
2021-12-27,0.127144,0.636117,0.054997,0.161617,0.515032,0.715841,0.699509
2021-12-21,0.424157,0.151005,0.433022,0.927524,0.689907,0.010632,0.155599
2021-12-26,0.510408,0.656724,0.621274,0.656600,0.174559,0.381545,0.075056
2021-12-24,0.667816,0.887328,0.850799,0.872071,0.757067,0.815802,0.366018
2021-12-23,0.859046,0.581690,0.761783,0.894375,0.173263,0.548198,0.558434

In [ ]:
# sort dataframe by column c1 in dscending order

In [ ]:
dframe.sort_values(by='C1',ascending = False)

,C1,C2,C3,C4,C5,C6,C7
2021-12-23,0.859046,0.581690,0.761783,0.894375,0.173263,0.548198,0.558434
2021-12-24,0.667816,0.887328,0.850799,0.872071,0.757067,0.815802,0.366018
2021-12-26,0.510408,0.656724,0.621274,0.656600,0.174559,0.381545,0.075056
2021-12-21,0.424157,0.151005,0.433022,0.927524,0.689907,0.010632,0.155599
2021-12-27,0.127144,0.636117,0.054997,0.161617,0.515032,0.715841,0.699509
2021-12-25,0.031818,0.451595,0.795075,0.912598,0.132277,0.606062,0.355492
2021-12-22,0.005737,0.920939,0.286573,0.103624,0.095670,0.771766,0.452133

In [ ]:
dframe

,C1,C2,C3,C4,C5,C6,C7
2021-12-21,0.424157,0.151005,0.433022,0.927524,0.689907,0.010632,0.155599
2021-12-22,0.005737,0.920939,0.286573,0.103624,0.095670,0.771766,0.452133
2021-12-23,0.859046,0.581690,0.761783,0.894375,0.173263,0.548198,0.558434
2021-12-24,0.667816,0.887328,0.850799,0.872071,0.757067,0.815802,0.366018
2021-12-25,0.031818,0.451595,0.795075,0.912598,0.132277,0.606062,0.355492
2021-12-26,0.510408,0.656724,0.621274,0.656600,0.174559,0.381545,0.075056
2021-12-27,0.127144,0.636117,0.054997,0.161617,0.515032,0.715841,0.699509

In [ ]:
dframe1 = dframe

In [ ]:
dframe

,C1,C2,C3,C4,C5,C6,C7
2021-12-21,0.424157,0.151005,0.433022,0.927524,0.689907,0.010632,0.155599
2021-12-22,0.005737,0.920939,0.286573,0.103624,0.095670,0.771766,0.452133
2021-12-23,0.859046,0.581690,0.761783,0.894375,0.173263,0.548198,0.558434
2021-12-24,0.667816,0.887328,0.850799,0.872071,0.757067,0.815802,0.366018
2021-12-25,0.031818,0.451595,0.795075,0.912598,0.132277,0.606062,0.355492
2021-12-26,0.510408,0.656724,0.621274,0.656600,0.174559,0.381545,0.075056
2021-12-27,0.127144,0.636117,0.054997,0.161617,0.515032,0.715841,0.699509

In [ ]:
# delete column in data frame

In [ ]:
del dframe['C6']

In [ ]:
dframe

                  C1        C2        C3        C4        C5        C7
2021-12-21  0.424157  0.151005  0.433022  0.927524  0.689907  0.155599
2021-12-22  0.005737  0.920939  0.286573  0.103624  0.095670  0.452133
2021-12-23  0.859046  0.581690  0.761783  0.894375  0.173263  0.558434
2021-12-24  0.667816  0.887328  0.850799  0.872071  0.757067  0.366018
2021-12-25  0.031818  0.451595  0.795075  0.912598  0.132277  0.355492
2021-12-26  0.510408  0.656724  0.621274  0.656600  0.174559  0.075056
2021-12-27  0.127144  0.636117  0.054997  0.161617  0.515032  0.699509

In [ ]:
dframe.pop('C4')

2021-12-21    0.927524
2021-12-22    0.103624
2021-12-23    0.894375
2021-12-24    0.872071
2021-12-25    0.912598
2021-12-26    0.656600
2021-12-27    0.161617
Freq: D, Name: C4, dtype: float64

In [ ]:
dframe.drop(['C2'],axis=1)

                  C1        C3        C5        C7
2021-12-21  0.424157  0.433022  0.689907  0.155599
2021-12-22  0.005737  0.286573  0.095670  0.452133
2021-12-23  0.859046  0.761783  0.173263  0.558434
2021-12-24  0.667816  0.850799  0.757067  0.366018
2021-12-25  0.031818  0.795075  0.132277  0.355492
2021-12-26  0.510408  0.621274  0.174559  0.075056
2021-12-27  0.127144  0.054997  0.515032  0.699509

In [ ]:
#delete rows in data frame

In [ ]:
dframe

                  C1        C2        C3        C5        C7
2021-12-21  0.424157  0.151005  0.433022  0.689907  0.155599
2021-12-22  0.005737  0.920939  0.286573  0.095670  0.452133
2021-12-23  0.859046  0.581690  0.761783  0.173263  0.558434
2021-12-24  0.667816  0.887328  0.850799  0.757067  0.366018
2021-12-25  0.031818  0.451595  0.795075  0.132277  0.355492
2021-12-26  0.510408  0.656724  0.621274  0.174559  0.075056
2021-12-27  0.127144  0.636117  0.054997  0.515032  0.699509

In [ ]:
df11 = pd.DataFrame([12,34,56,78,90])

In [ ]:
df11.drop([2,3],axis =0)

    0
0  12
1  34
4  90

In [ ]:
df11

    0
0  12
1  34
2  56
3  78
4  90

In [ ]:
df11.drop([3,4],axis =0 )

    0
0  12
1  34
2  56

In [ ]:
dframe

                  C1        C2        C3        C5        C7
2021-12-21  0.424157  0.151005  0.433022  0.689907  0.155599
2021-12-22  0.005737  0.920939  0.286573  0.095670  0.452133
2021-12-23  0.859046  0.581690  0.761783  0.173263  0.558434
2021-12-24  0.667816  0.887328  0.850799  0.757067  0.366018
2021-12-25  0.031818  0.451595  0.795075  0.132277  0.355492
2021-12-26  0.510408  0.656724  0.621274  0.174559  0.075056
2021-12-27  0.127144  0.636117  0.054997  0.515032  0.699509

In [ ]:
dframe1

                  C1        C2        C3        C5        C7
2021-12-21  0.424157  0.151005  0.433022  0.689907  0.155599
2021-12-22  0.005737  0.920939  0.286573  0.095670  0.452133
2021-12-23  0.859046  0.581690  0.761783  0.173263  0.558434
2021-12-24  0.667816  0.887328  0.850799  0.757067  0.366018
2021-12-25  0.031818  0.451595  0.795075  0.132277  0.355492
2021-12-26  0.510408  0.656724  0.621274  0.174559  0.075056
2021-12-27  0.127144  0.636117  0.054997  0.515032  0.699509

In [ ]:
dframe = pd.DataFrame(M,index = dates)

In [ ]:
dframe.columns = ['C1','C2','C3','C4','C5','C6','C7']

In [ ]:
dframe

,C1,C2,C3,C4,C5,C6,C7
2021-12-21,0.424157,0.151005,0.433022,0.927524,0.689907,0.010632,0.155599
2021-12-22,0.005737,0.920939,0.286573,0.103624,0.095670,0.771766,0.452133
2021-12-23,0.859046,0.581690,0.761783,0.894375,0.173263,0.548198,0.558434
2021-12-24,0.667816,0.887328,0.850799,0.872071,0.757067,0.815802,0.366018
2021-12-25,0.031818,0.451595,0.795075,0.912598,0.132277,0.606062,0.355492
2021-12-26,0.510408,0.656724,0.621274,0.656600,0.174559,0.381545,0.075056
2021-12-27,0.127144,0.636117,0.054997,0.161617,0.515032,0.715841,0.699509

# data selection in data frame

In [ ]:
df

  Language  Rating     Type
0   Python       1   simple
1     java       3   medium
2        C       4    Basic
3      C++       2  Typical

In [ ]:
# data selection using row lable

In [ ]:
df.loc[2]

Language        C
Rating          4
Type        Basic
Name: 2, dtype: object

In [ ]:
# data selection using position ( integer index)

In [ ]:
df.iloc[1]

Language      java
Rating           3
Type        medium
Name: 1, dtype: object

In [ ]:
df

  Language  Rating     Type
0   Python       1   simple
1     java       3   medium
2        C       4    Basic
3      C++       2  Typical

In [ ]:
df

  Language  Rating     Type
0   Python       1   simple
1     java       3   medium
2        C       4    Basic
3      C++       2  Typical

In [ ]:
df12 = pd.DataFrame(['satya','vamsi','uday','pranay'],index= ['a','b','c','d'])

In [ ]:
df12

        0
a   satya
b   vamsi
c    uday
d  pranay

In [ ]:
df12.loc['a']

0    satya
Name: a, dtype: object

In [ ]:
df12.iloc[3]

0    pranay
Name: d, dtype: object

In [ ]:
df12

        0
a   satya
b   vamsi
c    uday
d  pranay

In [ ]:
df12.loc['b':'c']

       0
b  vamsi
c   uday

In [ ]:
data = pd.read_csv('iris.csv')

In [ ]:
data

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [ ]:
data.head()

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [ ]:
data.head(10)

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa
5           5.4          3.9           1.7          0.4  Setosa
6           4.6          3.4           1.4          0.3  Setosa
7           5.0          3.4           1.5          0.2  Setosa
8           4.4          2.9           1.4          0.2  Setosa
9           4.9          3.1           1.5          0.1  Setosa

In [ ]:
data.tail()

     sepal.length  sepal.width  petal.length  petal.width    variety
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

In [ ]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal.length  150 non-null    float64
 1   sepal.width   150 non-null    float64
 2   petal.length  150 non-null    float64
 3   petal.width   150 non-null    float64
 4   variety       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [ ]:
data.describe()

       sepal.length  sepal.width  petal.length  petal.width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [ ]:
data['sepal.length'].head(20)

0     5.1
1     4.9
2     4.7
3     4.6
4     5.0
5     5.4
6     4.6
7     5.0
8     4.4
9     4.9
10    5.4
11    4.8
12    4.8
13    4.3
14    5.8
15    5.7
16    5.4
17    5.1
18    5.7
19    5.1
Name: sepal.length, dtype: float64

In [ ]:
data[data['petal.length']>6]

     sepal.length  sepal.width  petal.length  petal.width    variety
105           7.6          3.0           6.6          2.1  Virginica
107           7.3          2.9           6.3          1.8  Virginica
109           7.2          3.6           6.1          2.5  Virginica
117           7.7          3.8           6.7          2.2  Virginica
118           7.7          2.6           6.9          2.3  Virginica
122           7.7          2.8           6.7          2.0  Virginica
130           7.4          2.8           6.1          1.9  Virginica
131           7.9          3.8           6.4          2.0  Virginica
135           7.7          3.0           6.1          2.3  Virginica

In [ ]:
data['sepal.width'].mean()

3.057333333333334